---
type: ElectricalAnalyticalLoadSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 5
tags: [revit-api, class]
---

# ElectricalAnalyticalLoadSet

`Autodesk.Revit.DB.Electrical.ElectricalAnalyticalLoadSet` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2024 | `public static ElectricalAnalyticalLoadSet Create ( Document document , string name )` |
| Method | GetLoadIds | 2024 | `public ISet < ElementId > GetLoadIds ()` |
| Property | Parameter | — | `` |
| Property | QuantityOnStandBy | 2024 | `public int QuantityOnStandBy { get ; set ; }` |
| Property | TotalQuantity | 2024 | `public int TotalQuantity { get ; }` |